import java.util.*;

class Solution
{
    public int solution(int n, int a, int b)
    {
        int answer= 0;
        
        for(answer = 0 ; a!=b ; answer++){
            a = (a + 1) / 2;
            b = (b + 1) /2;
        }
        
        return answer;
    }
}

// 예를 들어 4번 참가자가 7번이랑 뜨고 싶은데 몇번째에서 만나는지 궁금하다
// 1라운드에서 4번(A)은 3번과 뜸 -> A가 승
// 1라운드에서 7번 (B)은 8번과 뜸 -> B가 승

// 1-2 싸움에선 승자가 1이 된다  
//                          1-2 싸움에선 승자가 1이 된다.
// 3-4 싸움에선 승자가 2가 된다  
//                                                      1-2 싸움에서 승자가 1이 된다
// 5-6 싸움에선 승자가 3이 된다
//                          3-4 싸움에선 승자가 2이 된다.
// 7-8 싸움에선 승자가 4이 된다

// 토너먼트니까 항상 1회가 끝날 때마다 생존자는 N/2 가 된다.
